# -*- coding: utf-8 -*-
"""
templates_x2是含有两个查询词的模板，共4种：
1.x1的x2?
2.x1如何x2?
3.x1的x2有哪些？
4.x1的x2是什么？
"""
__title__ = 'QGDT'
__author__ = 'Ex_treme'
__license__ = 'MIT'
__copyright__ = 'Copyright 2018, Ex_treme'

#x1的x2?
x1_x2_1 = [
    'Anti-DDoS流量清洗 告警提醒API接口',
    '开通Anti-DDoS服务 功能介绍',
    'Anti-DDoS流量清洗 修订记录',
    'Anti-DDoS流量清洗 错误码说明',
    '多维交互分析服务 API使用流程简介',
    '多维交互分析服务 M-OLAP简介',
    '镜像视图 概念',
]

#x1如何x2?
x1_x2_2 = [
    'Anti-DDoS流量清洗 查询周防护统计情况',
    'Anti-DDoS流量清洗 获取项目编号',
    '多维交互分析服务 新建文件夹',
    '多维交互分析服务 扩容集群节点',
    '多维交互分析服务 新增作业',
    '多维交互分析服务 导入导出数据',
    '镜像服务 增加标签',
    '镜像服务 生成AK、SK',
    '弹性负载均衡 删除证书',
    '弹性负载均衡 变更规则',
    '弹性负载均衡 修改监听器',
    '统一身份认证服务 注册身份提供商'
]

#x1的x2有哪些？
x1_x2_3 = [
    '多维交互分析服务 常见问题',
    '多维交互分析服务 M-OLAP特性',
    '镜像服务 签名前的准备',
    '镜像服务 资料下载',
    '弹性负载均衡监控指标说明 监控指标',
    '统一身份认证服务 用户组',

]


#x1的x2是什么？
x1_x2_4 = [
    '开通Anti-DDoS服务 URI',
    '查询Anti-DDoS任务 请求',
    '更新Anti-DDoS服务 返回值',
    '多维交互分析服务 接口定义',
    '多维交互分析服务 M-OLAP结构',
    '镜像服务 请求认证方式',
    '镜像服务 接口调用方法',
    '弹性负载均衡监控指标说明 命名空间',
    '弹性负载均衡 ELB',

]




if __name__ == "__main__":
    pass