Repository: pypi-data/pypi-mirror-33
Catalog: packages/django-courriers/django-courriers-0.9.0.tar.gz/django-courriers-0.9.0/courriers/locale/*/LC_MESSAGES/django.po
Languages: de

source: The newsletter "%s" has been sent.
de: Die Newsletter "%s" wurde versendet.

source: Please specify your MAILCHIMP API key in Django settings
de: Bitte den ihren MAILCHIMP API Key in den Django settings angeben

source: Please specify your MAILJET API key in Django settings
de: Bitte den ihren MAILJET API Key in den Django settings angeben

source: Please specify your MAILJET API SECRET key in Django settings
de: Bitte den ihren MAILJET API SECRET Key in den Django settings angeben

source: Your email
de: Ihre Emailadresse

source: You already subscribe to this newsletter.
de: Sie haben diese Newsletter bereits abonniert.

source: You are not subscribed to this newsletter.
de: Sie haben diese Newsletter nicht abonniert.

source: Draft
de: Entwurf

source: Do you really want to send this newsletter?
de: Wollen sie diese Newsletter wirklich versenden?

source: History
de: Verlauf

source: View on site
de: Auf der Webseite anzeigen

source: Thank you. You successfully subscribe to this newsletter !
de: Vielen Dank. Sie haben diese Newsletter erfolgreich abonniert.

source: Subscribe to the newsletter
de: Newsletter abonnieren

source: Close
de: Schlie√üen

source: Your e-mail
de: Ihre Emailadresse

source: Thank you. You're now unsubscribed from this newsletter.
de: Sie sind nun von dieser Newsletter abgemeldet.

source: Thank you. You're now unsubscribed from all our newsletters.
de: Sie sind nun von allen unseren Newslettern abgemeldet.
