# -*- coding: utf-8 -*-
"""
templates_x1是只有一个查询词的模板，共4种：
1.x1?
2.如何x1?
3.x1有哪些？
4.x1是什么？
"""
__title__ = 'QGDT-cpu'
__author__ = 'Ex_treme'
__license__ = 'MIT'
__copyright__ = 'Copyright 2018, Ex_treme'

#x1?
x1_1 = [
    '数据快递服务操作指导',
    '上云攻略',
    '卸载云硬盘时数据会丢失吗',
    '云硬盘有多少种状态',
    '快照有多少种状态',
    '一台云服务器可以挂载几块云硬盘',
    '怎么扩容数据盘',
]

#如何x1?
x1_2 = [
    '关闭Anti-DDoS服务',
    '更新Anti-DDoS服务',
    '制作镜像',
    '批量更新镜像成员状态',
    '导出镜像',
    '挂载云硬盘（OpenStack原生）'
'开通Anti-DDoS服务',
'查询Anti-DDoS任务',
'查询Anti-DDoS配置可选范围',
'关闭Anti-DDoS服务',
'更新Anti-DDoS服务',
'查询Anti-DDoS服务',
'聊天',
'标注',
'预约会议',
'音视频会议业务初始化',
'开发实现',
'卸载云硬盘（OpenStack原生）',
'添加云硬盘的元数据（OpenStack原生）',
'扩容云硬盘',
'删除云硬盘',
'删除云硬盘的单个元数据（OpenStack原生）',
'查询云硬盘列表',
'回滚快照到云硬盘',
'查询云硬盘快照的元数据（OpenStack原生）',
'获取项目编号',
'查询云硬盘快照详细信息列表（OpenStack原生）',
'查询所有云硬盘详情（OpenStack原生）',
'查询单个云硬盘类型的详细信息（OpenStack原生）',
'更新云硬盘的元数据（OpenStack原生）',
'购买云硬盘备份服务',


]

#x1有哪些?
x1_3 = [
    '通信平台云常见问题',
    '密钥管理服务常见问题',
    '操作类常见问题',
    '安全组常见问题',
    '接口调用方法',
    '文档修订记录',
]


#x1是什么?
x1_4 = [
    'Anti-DDoS流量清洗',
    '多维交互分析服务',
    '弹性负载均衡',
    '弹性负载均衡监控指标说明',
    'AK/SK认证',
'Step8调试运行',
'Android',
'渐进式会议',
'HelloWorld',
  '镜像视图',
'弹性负载均衡监控指标说明',
'云硬盘',
'更新云硬盘快照的单个元数据（OpenStack原生）',
'云硬盘快照状态',
'云硬盘快照',
'云硬盘备份',

]




if __name__ == "__main__":
    pass