Repository: pypi-data/pypi-mirror-33
Catalog: packages/django-zxcvbn-password-validator/django-zxcvbn-password-validator-1.2.0.tar.gz/django-zxcvbn-password-validator-1.2.0/django_zxcvbn_password_validator/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Use a few words, avoid common phrases
fr: Utilisez quelques mots, évitez les mots souvent utilisés ensemble

source: No need for symbols, digits, or uppercase letters
fr: Pas besoin de symboles, nombres, ou lettre en majuscule

source: Add another word or two. Uncommon words are better.
fr: Ajoutez un mot ou deux. C'est mieux si ils ne sont pas courants.

source: Straight rows of keys are easy to guess
fr: Les alignements de touche sont faciles à deviner

source: Short keyboard patterns are easy to guess
fr: Les petits motifs de clavier sont faciles à deviner

source: Use a longer keyboard pattern with more turns
fr: Utilisez un motif sur la clavier plus long avec plus de changement de direction.

source: Repeats like "aaa" are easy to guess
fr: Les répétitions du type "aaa" sont faciles à deviner

source: Repeats like "abcabcabc" are only slightly harder to guess than "abc"
fr: Les répétitions du type "abcabcabc" sont à peine plus dures à deviner que "abc"

source: Avoid repeated words and characters
fr: Évitez de répéter des mots ou caractères

source: Sequences like "abc" or "6543" are easy to guess
fr: Les séquences du type "abc" ou "6543" sont faciles à deviner

source: Avoid sequences
fr: Évitez les séquences

source: Recent years are easy to guess
fr: Les années récentes sont faciles à deviner

source: Avoid recent years
fr: Évitez les années récentes

source: Avoid years that are associated with you
fr: Évitez les années associés aux événements de votre vie

source: Dates are often easy to guess
fr: Les dates sont souvent faciles à deviner

source: Avoid dates and years that are associated with you
fr: Évitez les dates et années associées aux événements de votre vie

source: This is a top-10 common password
fr: C'est l'un des 10 mot de passe les plus utilisés

source: This is a top-100 common password
fr: C'est l'un des 100 mot de passe les plus utilisés

source: This is a very common password
fr: C'est un mot de passe très courant

source: This is similar to a commonly used password
fr: C'est similaire à un mot de passe courant

source: A word by itself is easy to guess
fr: Un mot pris de manière isolé est facile à deviner

source: Names and surnames by themselves are easy to guess
fr: Les noms et surnoms pris de manière isolés sont faciles à deviner

source: Common names and surnames are easy to guess
fr: Les noms courants et les surnoms sont faciles à deviner

source: Capitalization doesn't help very much
fr: La capitalisation des caractères n'aide pas beaucoup

source: All-uppercase is almost as easy to guess as all-lowercase
fr: Tout-majuscule est à peine plus dure à deviner que tout-minuscule

source: Reversed words aren't much harder to guess
fr: Les mots dont l'ordre des lettres est inversé sont à peine plus dure à deviner que le mot lui même.

source: Predictable substitutions like '@' instead of 'a' don't help very much
fr: Les substitutions prévisibles comme '@' à la place de 'a' n'aident pas beaucoup.

source: Your password is too guessable :
fr: Votre mot de passe est trop facile à deviner :

source: It would take an offline attacker {time} to guess it.
fr: Le deviner prendrait {time} à un attaquant ayant accès à notre base de données.

source: Warning
fr: Attention

source: What you can do is
fr: Vous pouvez faire ce qui suit

source: We expect
fr: Nous nous attendons à

source: nothing : you can use any password you want.
fr: rien : vous pouvez utiliser n'importe quel mot de passe.

source: a password that cannot be guessed
fr: un mot de passe qui ne ne peut pas être deviné

source: by your familly or friends.
fr: par votre famille ou vos amis.

source: by attackers online.
fr: par des aggresseurs depuis internet.

source: without access to our database.
fr: à moins d'avoir accès à notre base de données.

source: without a dedicated team and an access to our database.
fr: à moins d'avoir une équipe dédiée et un accès à notre base de données.

source: There is no specific rule for a great password,
fr: Il n'y a pas de règle absolue pour un bon mot de passe,

source: however if your password is too easy to guess,
fr: cependant si votre mot de passe est trop facile à deviner,

source: we will tell you how to make a better one.
fr: nous vous dirons comment l'améliorer.
