Repository: pypi-data/pypi-mirror-33
Catalog: packages/onegov.gazette/onegov.gazette-1.14.2-py3-none-any.whl/onegov/gazette/locale/*/LC_MESSAGES/onegov.gazette.po
Languages: de_ch

source: Group
de_ch: Gruppe

source: Title
de_ch: Titel

source: Active
de_ch: Aktiv

source: Parent Organization
de_ch: Übergeordnete Organisation

source: Number
de_ch: Nummer

source: Date
de_ch: Datum

source: Deadline
de_ch: Eingabeschluss

source: State
de_ch: Status

source: Source
de_ch: Quelle

source: Author Place
de_ch: Absender Ort

source: Author Date
de_ch: Absender Datum

source: Author Name
de_ch: Absender Name

source: Issues
de_ch: Ausgaben

source: Expiry Date
de_ch: Ablaufdatum

source: Category
de_ch: Rubrik

source: Organization
de_ch: Organisation

source: Print only
de_ch: Stopp Internet

source: Liable to pay costs
de_ch: Kostenpflichtig

source: Billing address
de_ch: Rechnungsadresse

source: Editors
de_ch: Redaktoren

source: Organizations
de_ch: Organisationen

source: Categories
de_ch: Rubriken

source: Official Notices
de_ch: Amtliche Publikationen

source: New official notices
de_ch: Neue amtliche Publikationen

source: Show all
de_ch: Alle anzeigen

source: Show less
de_ch: Weniger anzeigen

source: No. ${issue_number}, ${issue_date} / ${notice_number}
de_ch: Nr. ${issue_number}, ${issue_date} / ${notice_number}

source: No. ${issue_number}, ${issue_date}
de_ch: Nr. ${issue_number}, ${issue_date}

source: Press Releases
de_ch: Medienmitteilungen

source: Manage
de_ch: Verwalten

source: Statistics
de_ch: Statistiken

source: Users
de_ch: Benutzer

source: Groups
de_ch: Gruppen

source: SOGC Import
de_ch: SHAB Import

source: Published Official Notices
de_ch: Veröffentlichte amtliche Publikationen

source: Published Press Releases
de_ch: Veröffentlichte Medienmitteilungen

source: Gazette
de_ch: Amtsblatt

source: Index
de_ch: Stichwortverzeichnis

source: Blocking period
de_ch: Sperrfrist

source: imported
de_ch: importiert

source: This value already exists.
de_ch: Dieser Wert ist bereits vorhanden.

source: This value is in use.
de_ch: Dieser Wert wird verwendet.

source: drafted
de_ch: in Arbeit

source: submitted
de_ch: eingereicht

source: rejected
de_ch: zurückgewiesen

source: accepted
de_ch: angenommen

source: published
de_ch: veröffentlicht

source: created
de_ch: erstellt

source: Leave blank to set the value automatically.
de_ch: Leer lassen, um den Wert automatisch zu setzen.

source: Comment
de_ch: Bemerkung

source: Canton
de_ch: Kanton

source: Clear
de_ch: Löschen

source: Accept
de_ch: Annehmen

source: Title (maximum 60 characters)
de_ch: Titel (höchstens 60 Zeichen)

source: Issue(s)
de_ch: Ausgabe(n)

source: Boilerplates
de_ch: Textbausteine

source: Place
de_ch: Ort

source: Date (usually the date of the issue)
de_ch: Datum (entspricht in der Regel dem Ausgabedatum)

source: Author
de_ch: Absender (z.B. Gemeinde Au, Planung/Bau)

source: No
de_ch: Nein

source: Yes
de_ch: Ja

source: Select one
de_ch: Bitte auswählen

source: External ID
de_ch: Externe ID

source: - none -
de_ch: - keine -

source: Lead (maximum 140 characters)
de_ch: Lead (maximal 140 Zeichen)

source: Publication date
de_ch: Publikationsdatum

source: Contact
de_ch: Kontaktperson

source: Press conference
de_ch: Pressekonferenz

source: Platforms
de_ch: Plattformen

source: Role
de_ch: Rolle

source: Publisher
de_ch: Herausgeber

source: Editor
de_ch: Redaktor

source: Archive
de_ch: Archiv

source: Close
de_ch: Schliessen

source: Attachment
de_ch: Anhang

source: Actions
de_ch: Aktionen

source: No attachments.
de_ch: Keine Anhänge.

source: Delete
de_ch: Löschen

source: Drop files to upload
de_ch: Dateien zum Hochladen hier ablegen

source: Upload
de_ch: Hochladen

source: New
de_ch: Neu

source: No categories.
de_ch: Keine Rubriken.

source: Edit
de_ch: Bearbeiten

source: Download
de_ch: Herunterladen

source: Download as XLSX.
de_ch: Als XLSX herunterladen.

source: No official notices.
de_ch: Keine amtliche Publikationen.

source: Rejected
de_ch: Zurückgewiesen

source: User
de_ch: Benutzer

source: Drafted
de_ch: in Arbeit

source: Submitted
de_ch: Eingereicht

source: No press releases.
de_ch: Keine Medienmitteilungen.

source: Issue date
de_ch: Ausgabedatum

source: The form contains errors. Please check the fields marked in red.
de_ch: Das Formular enthält Fehler. Bitte die rot markierten Felder überprüfen.

source: Number of Users
de_ch: Anzahl Benutzer

source: No groups.
de_ch: Keine Gruppen.

source: Upcoming Issues
de_ch: Kommende Ausgaben

source: Issue
de_ch: Ausgabe

source: No upcoming issues.
de_ch: Keine kommenden Ausgaben.

source: Publish
de_ch: Veröffentlichen

source: Past Issues
de_ch: Vergangene Ausgaben

source: No past issues.
de_ch: Keine vergangenen Ausgaben.

source: homepage
de_ch: Startseite

source: Login
de_ch: Anmelden

source: Logged in as
de_ch: Angemeldet als

source: Logout
de_ch: Abmelden

source: Help
de_ch: Hilfe

source: Forgot your password?
de_ch: Passwort vergessen?

source: Reset password
de_ch: Passwort zurücksetzen

source: Cancel
de_ch: Abbrechen

source: Submit Form
de_ch: Absenden

source: Previous Page
de_ch: Vorherige Seite

source: Next Page
de_ch: Nächste Seite

source: You are here
de_ch: Aktuelle Seite

source: Next deadline
de_ch: Nächster Eingabeschluss

source: This press release is blocked until ${blocking_date}.
de_ch: Dieses Medienmitteilung ist bis zum ${blocking_date} gesperrt.

source: Attachments
de_ch: Anhänge

source: Dear Sir or Madam,
de_ch: Sehr geehrte Dame, sehr geehrter Herr

source: Click the following link to confirm your subscription:
de_ch: Klicken Sie auf den folgenden Link, um Ihr Abonnement zu bestätigen:

source: Confirm subscription
de_ch: Abonnement bestätigen

source: Dear Sirs and Madams,
de_ch: Sehr geehrte Damen und Herren,

source: Your official notice has been rejected:
de_ch: Ihr Inserat für den amtlichen Teil des Amtsblatts wurde zurückgewiesen:

source: Click the following link to set a new password:
de_ch: Klicken Sie auf den folgenden Link, um ein Passwort für die Einreichung von Amtsblattinseraten zu setzen:

source: If you don't want to change your password, you can ignore this email.
de_ch: Sie können dieses E-Mail ignorieren, falls Sie Ihr Passwort nicht ändern möchten.

source: Dear Publisher,
de_ch: Sehr geehrte Amtsblattredaktion

source: Please publish the following official notice:
de_ch: Bitte publizieren Sie folgendes Inserat für den amtlichen Teil

source: There are new official notices:
de_ch: Es sind neue amtliche Publikationen erschienen:

source: Official notices
de_ch: Amtliche Publikationen

source: Your user account has been created.
de_ch: Ihr Benutzerkonto für die Einreichung von Amtsblattinseraten wurde erstellt.

source: Click the following link to set a password:
de_ch: Klicken Sie auf den folgenden Link um ein Passwort festzulegen:

source: Set password
de_ch: Passwort festlegen

source: This official notice has been rejected.
de_ch: Diese amtliche Publikation wurde zurückgewiesen.

source: Changes
de_ch: Änderungen

source: Date/Time
de_ch: Datum/Zeit

source: Change
de_ch: Änderung

source: Print
de_ch: Drucken

source: Search
de_ch: Suche

source: Submit
de_ch: Einreichen

source: Download the selected official notices as PDF.
de_ch: Die ausgewählten amtlichen Publikationen als PDF herunterladen.

source: Download an index for the selected official notices (PDF).
de_ch: Das Stichwortregister für die ausgewählten amtlichen Publikationen als PDF herunterladen.

source: Ordering
de_ch: Sortierung

source: Term
de_ch: Suchbegriff

source: From
de_ch: Von

source: To
de_ch: Bis

source: SOGC
de_ch: SHAB

source: All publications
de_ch: Alle Publikationen

source: Only publications from the SOGC
de_ch: Nur Publikationen aus dem SHAB

source: Exclude publications from the SOGC
de_ch: Publikationen aus dem SHAB ausschliessen

source: Reset
de_ch: Zurücksetzen

source: Search Results
de_ch: Suchergebnisse

source: Subscribe to the current search query
de_ch: Suchanfrage abonnieren

source: Download the search results as PDF
de_ch: Suchergebnisse als PDF herunterladen

source: Order
de_ch: Ordnen

source: No organizations.
de_ch: Keine Organisationen.

source: Order Organizations
de_ch: Organisationen ordnen

source: This press release has been rejected.
de_ch: Diese Medienmitteilung wurde zurückgewiesen.

source: Sessions
de_ch: Sitzungen

source: Login Timestamp
de_ch: Anmeldung

source: IP Address
de_ch: Adresse

source: User Agent
de_ch: Browser

source: Clear Sessions
de_ch: Sitzungen beenden

source: Filter by date
de_ch: Nach Datum filtern

source: By Organizations
de_ch: Organisationen

source: Count
de_ch: Anzahl

source: By Categories
de_ch: Rubriken

source: By Groups
de_ch: Gruppen

source: No users.
de_ch: Keine Benutzer.

source: Wrong username or password
de_ch: Unbekannter Benutzername oder falsches Passwort

source: A password reset link has been sent to ${email}, provided an account exists for this email address.
de_ch: Eine E-Mail wurde an ${email} gesendet (sofern die Adresse gültig ist).

source: Wrong username or password reset link not valid any more.
de_ch: Ungültige Adresse oder abgelaufener Link.

source: Password changed.
de_ch: Passwort geändert.

source: Password reset
de_ch: Persönliches Passwort Amtsblattredaktion zurücksetzen

source: New Category
de_ch: Neue Rubrik

source: Save
de_ch: Speichern

source: Edit Category
de_ch: Rubrik bearbeiten

source: Do you really want to delete "${item}"?
de_ch: Möchten Sie "${item}" wirklich löschen?

source: Delete Category
de_ch: Rubrik löschen

source: Category added.
de_ch: Rubrik hinzugefügt.

source: Category modified.
de_ch: Rubrik geändert.

source: Only unused categorys may be deleted.
de_ch: Es können nur unbenutzte Rubriken gelöscht werden.

source: Category deleted.
de_ch: Rubrik gelöscht.

source: Access Denied
de_ch: Zugriff verweigert

source: You are trying to open a page for which you are not authorized.
de_ch: Sie versuchen eine Seite zu öffnen, für die Sie nicht autorisiert sind.

source: Page not Found
de_ch: Seite nicht gefunden

source: The page you are looking for could not be found.
de_ch: Die angeforderte Seite konnte nicht gefunden werden.

source: New Group
de_ch: Neue Gruppe

source: Edit Group
de_ch: Gruppe bearbeiten

source: Delete Group
de_ch: Gruppe löschen

source: Group added.
de_ch: Gruppe hinzugefügt.

source: Group modified.
de_ch: Gruppe geändert.

source: There are official notices linked to this group!
de_ch: Diese Gruppe hat amtliche Publikationen!

source: Only groups without users may be deleted.
de_ch: Es können nur Gruppen ohne Benutzer gelöscht werden.

source: Group deleted.
de_ch: Gruppe gelöscht.

source: New Issue
de_ch: Neue Ausgabe

source: Edit Issue
de_ch: Ausgabe bearbeiten

source: Delete Issue
de_ch: Ausgabe löschen

source: Do you really want to publish "${item}"? This will assign the publication numbers to the official notices and create the PDF.
de_ch: "${item}" veröffentlichen? Es werden die Publikationsnummern vergeben und das PDF generiert.

source: Issue added.
de_ch: Ausgabe hinzugefügt.

source: Issue modified.
de_ch: Ausgabe geändert.

source: Only unused issues may be deleted.
de_ch: Es können nur unbenutzte Ausgaben gelöscht werden.

source: Issue deleted.
de_ch: Ausgabe gelöscht.

source: There are submitted notices for this issue!
de_ch: Diese Ausgabe hat eingereichte amtliche Publikationen!

source: A PDF already exists for this issue!
de_ch: Diese Ausgabe hat bereits ein PDF!

source: There are already official notices with publication numbers!
de_ch: Diese Ausgabe hat bereits Publikationsnummern!

source: Issue published.
de_ch: Ausgabe veröffentlicht.

source: The already assigned publication numbers have been changed. Recreating the following issues might be needed.
de_ch: Die Publikationsnummern haben geändert! Möglicherweise müssen die darauffolgenden Ausgaben neu veröffentlicht werden.

source: Edit Official Notice
de_ch: Amtliche Publikation bearbeiten

source: The fields marked with an asterisk * are mandatory fields.
de_ch: Die mit einem Stern * gekennzeichneten Felder sind Pflichtfelder.

source: Delete Official Notice
de_ch: Amtliche Publikation löschen

source: Copy
de_ch: Kopieren

source: Preview
de_ch: Vorschau

source: Reject
de_ch: Zurückweisen

source: View
de_ch: Anzeigen

source: Accepted official notices may not be edited.
de_ch: Angenommene amtliche Publikationen können nicht mehr bearbeitet werden.

source: The official notice has past issue. Please re-select issues.
de_ch: Bitte Ausgaben neu wählen.

source: The official notice has an invalid category. Please re-select the category.
de_ch: Bitte Rubrik neu wählen.

source: The official notice has an invalid organization. Please re-select the organization.
de_ch: Bitte Organisation neu wählen.

source: edited
de_ch: bearbeitet

source: Official notice modified.
de_ch: Amtliche Publikation geändert.

source: This official notice has already been accepted!
de_ch: Diese amtliche Publikation wurde bereits angenommen!

source: Only drafted or rejected official notices may be deleted.
de_ch: Es können nur zurückgewiesene amtliche Publikationen oder amtliche Publikationen in Arbeit gelöscht werden.

source: Official notice deleted.
de_ch: Amtliche Publikation gelöscht.

source: The official notice has issues for which the deadlines are reached. Please re-select valid issues.
de_ch: Bitte Ausgaben neu wählen.

source: This official notice has already been published!
de_ch: Diese amtliche Publikation wurde bereits veröffentlicht!

source: Attachment added.
de_ch: Anhang hinzugefügt.

source: Attachment deleted.
de_ch: Anhang gelöscht.

source: Attachments of accepted notices can not be deleted.
de_ch: Anhänge von angenommenen amtlichen Publikationen können nicht gelöscht werden.

source: Do you really want to submit "${item}"?
de_ch: "${item}" einreichen?

source: Submit Official Note
de_ch: Amtliche Publikation einreichen

source: Do you really want to accept "${item}"?
de_ch: "${item}" annehmen?

source: Accept Official Note
de_ch: Amtliche Publikation annehmen

source: Do you really want to reject "${item}"?
de_ch: "${item}" zurückweisen?

source: Reject Official Note
de_ch: Amtliche Publikation zurückweisen

source: Only drafted or rejected official notices may be submitted.
de_ch: Es können nur zurückgewiesene amtliche Publikationen oder amtliche Publikationen in Arbeit eingereicht werden.

source: Official notice submitted.
de_ch: Amtliche Publikation eingereicht.

source: Only submitted official notices may be accepted.
de_ch: Es können nur eingereichte amtliche Publikationen angenommen werden.

source: Official notice accepted.
de_ch: Amtliche Publikation angenommen.

source: Only submitted official notices may be rejected.
de_ch: Es können nur eingereichte amtliche Publikationen zurückgewiesen werden.

source: Official notice rejected.
de_ch: Amtliche Publikation zurückgewiesen.

source: mail sent
de_ch: Druck beauftragt

source: With costs
de_ch: Kostenpflichtig

source: Official Notice Rejected ${id}
de_ch: Inserat für den amtlichen Teil zurückgewiesen ${id}

source: New Official Notice
de_ch: Neue amtliche Publikation

source: Update notices
de_ch: Amtliche Publikationen aktualisieren

source: Update
de_ch: Aktualisieren

source: Notices updated.
de_ch: Amtliche Publikationen aktualisiert.

source: Confirm your subscription
de_ch: Abonnement bestätigen

source: Subscribe
de_ch: Abonnieren

source: Confirm
de_ch: Bestätigen

source: Thank You! Please check your email to activate your subscription.
de_ch: Danke! Bitte überprüfen Sie Ihre E-Mail, um Ihr Abonnement zu aktivieren.

source: Official Notice
de_ch: Amtliche Publikation

source: Your subscription has been successfully confirmed.
de_ch: Ihr Abonnement wurde erfolgreich bestätigt.

source: New Organization
de_ch: Neue Organisation

source: Edit Organization
de_ch: Organisation bearbeiten

source: Delete Organization
de_ch: Organisation löschen

source: Organization added.
de_ch: Organisation hinzugefügt.

source: Organization modified.
de_ch: Organisation geändert.

source: Only unused organizations with no sub-organisations may be deleted.
de_ch: Nur unbenutzte Organisationen ohne Unterorganisationen können gelöscht werden.

source: Organization deleted.
de_ch: Organisation gelöscht.

source: Edit Press Release
de_ch: Medienmitteilung bearbeiten

source: Delete Press Release
de_ch: Medienmitteilung löschen

source: The press release has an invalid organization. Please re-select the organization.
de_ch: Die Medienmitteilung hat eine ungültige Organisation. Wählen Sie die Organisation erneut aus.

source: Press release modified.
de_ch: Medienmitteilung geändert.

source: Only drafted or rejected press releases may be deleted.
de_ch: Es können nur zurückgewiesene Medienmitteilung oder Medienmitteilung in Arbeit gelöscht werden.

source: This press release has already been accepted!
de_ch: Diese Medienmitteilung wurde bereits angenommen!

source: Press release deleted.
de_ch: Medienmitteilung gelöscht.

source: Submit Press Release
de_ch: Medienmitteilung einreichen

source: Accept Press Release
de_ch: Medienmitteilung annehmen

source: Reject Press Release
de_ch: Medienmitteilung zurückweisen

source: Do you really want to publish "${item}"?
de_ch: "${item}" veröffentlichen?

source: Publish Press Release
de_ch: Medienmitteilung veröffentlichen

source: Only drafted or rejected press releases may be submitted.
de_ch: Es können nur zurückgewiesene Medienmitteilung oder Medienmitteilung in Arbeit eingereicht werden.

source: Press release submitted.
de_ch: Medienmitteilung eingereicht.

source: Only submitted press releases may be accepted.
de_ch: Es können nur eingereichte Medienmitteilung angenommen werden.

source: Press release accepted.
de_ch: Medienmitteilung angenommen.

source: Only submitted press releases may be rejected.
de_ch: Es können nur eingereichte Medienmitteilung zurückgewiesen werden.

source: Press release rejected.
de_ch: Medienmitteilung zurückgewiesen.

source: Only accepted press releases may be published.
de_ch: Es können nur angenommene Medienmitteilung veröffentlicht werden.

source: Press release published.
de_ch: Medienmitteilung veröffentlicht.

source: New Press Release
de_ch: Neue Medienmitteilung

source: Import
de_ch: Importieren

source: You have drafted messages with past issues.
de_ch: Sie haben amtliche Publikationen in Arbeit mit vergangenen Ausgaben.

source: You have drafted messages with issues close to the deadline.
de_ch: Sie haben amtliche Publikationen in Arbeit, für welche der Eingabeschluss bald erreicht ist.

source: You have rejected messages.
de_ch: Sie haben zurückgewiesene Publikationen.

source: Official notices imported.
de_ch: Amtliche Publikationen importiert.

source: New User
de_ch: Neuer Benutzer

source: Edit User
de_ch: Benutzer bearbeiten

source: Delete User
de_ch: Benutzer löschen

source: Do you really clear all active sessions?
de_ch: Wollen Sie wirklich alle Sitzungen beenden?

source: Publishers
de_ch: Herausgeber

source: User added.
de_ch: Benutzer hinzugefügt.

source: User modified.
de_ch: Benutzer geändert.

source: There are official notices linked to this user!
de_ch: Dieser Nutzer hat amtliche Publikationen!

source: User deleted.
de_ch: Benutzer gelöscht.

source: User account created
de_ch: Benutzerkonto Amtsblattredaktion erstellt
