Repository: pypi-data/pypi-mirror-33
Catalog: packages/osm-humanized-opening-hours/osm_humanized_opening_hours-1.0.0a1-py3-none-any.whl/humanized_opening_hours/locales/*/LC_MESSAGES/HOH.po
Languages: fr_fr

source: and
fr_fr: et

source: Every days
fr_fr: Tous les jours

source: open 24 hours a day and 7 days a week
fr_fr: ouvert 24 heures sur 24 et 7 jours sur 7

source: %Y %-d %B
fr_fr: %-d %B %Y

source: easter
fr_fr: pâques

source: {year}, from {month1} to {month2}
fr_fr: de {month1} à {month2} {year}

source: {year} in {month}
fr_fr: {month} {year}

source: from {month1} to {month2}
fr_fr: de {month1} à {month2}

source: from {date1_from} to the {date1_to}
fr_fr: de {date1_from} au {date1_to}

source: from {date1} to {date2}
fr_fr: du {date1} à {date2}

source: week {n}
fr_fr: semaine {4}

source: from week {week1} to week {week2}
fr_fr: de la semaine {week1} à la semaine {week2}

source: from week {week1} to week {week2}, every {n} weeks
fr_fr: de la semaine {week1} à la semaine {week2}, toutes les {n} semaines

source: from {year1} to {year2}
fr_fr: de {year1} à {year2}

source: from {year1} to {year2}, every {n} years
fr_fr: de {year1} à {year2}, tous les {n} ans

source: on {wd}
fr_fr: le {wd}

source: from {wd1} to {wd2}
fr_fr: du {wd1} au {wd2}

source: Public and school holidays
fr_fr: Jours fériés et vacances scolaires

source: public holidays
fr_fr: jours fériés

source: school holidays
fr_fr: vacances scolaires

source: sunrise
fr_fr: lever du soleil

source: sunset
fr_fr: coucher du soleil

source: dawn
fr_fr: aurore

source: dusk
fr_fr: crépuscule

source: {time} after sunrise
fr_fr: {time} après le lever du soleil

source: {time} after sunset
fr_fr: {time} après le coucher du soleil

source: {time} after dawn
fr_fr: {time} après l'aurore

source: {time} after dusk
fr_fr: {time} après le crépuscule

source: {time} before sunrise
fr_fr: {time} avant le lever du soleil

source: {time} before sunset
fr_fr: {time} avant le coucher du soleil

source: {time} before dawn
fr_fr: {time} avant l'aurore

source: {time} before dusk
fr_fr: {time} avant le crépuscule

source: from {} to {}
fr_fr: de {} à {}
