# -*- coding: utf-8 -*-
"""
templates_x3是含有三个查询词的模板，共4种：
1.x1x2的x3?
2.x1x2如何x3?
3.x1x2的x3有哪些？
4.x1x2的x3是什么？
"""
__title__ = 'QGDT-cpu'
__author__ = 'Ex_treme'
__license__ = 'MIT'
__copyright__ = 'Copyright 2018, Ex_treme'

#x1x2的x3?
x1_x2_x3_1 = [
    'Anti-DDoS流量清洗 查询指定EIP防护流量 功能介绍',
    'Anti-DDoS流量清洗 请求签名流程 签名前的准备',
    '多维交互分析服务 快速开始 应用程序实现',
    '镜像服务 镜像 概念',
    '统一身份认证服务 ECP断言处理接口 功能介绍',

]

#x1x2如何x3?
x1_x2_x3_2 = [
    '弹性负载均衡 变更规则 调整带宽',
    '软件开发云 应用场景 自动下载依赖包',
    '软件开发云 应用场景 编译构建包自动归档',
    '微服务云应用平台 特殊开发场景支持 使用Java接口进行服务调用',
    '微服务云应用平台 特殊开发场景支持 异常处理',
    '微服务云应用平台 实施指导 实施负载均衡',

]

#x1x2的x3有哪些？
x1_x2_x3_3 = [
    'Anti-DDoS流量清洗 Token认证 应用场景',
    '软件开发云 续费 操作场景',
    '云硬盘备份 包年包月方式 计费案例',
    '云审计服务 返回错误码说明 返回体格式',
    '云容器引擎 获取集群的metrics监控数据 状态码',
    '云监控服务 机器学习服务监控指标说明 维度',
]


#x1x2的x3是什么？
x1_x2_x3_4 = [
    'Anti-DDoS流量清洗 Token认证 调用接口步骤',
    'Anti-DDoS流量清洗 查询告警配置信息 URI',
    'Anti-DDoS流量清洗 查询指定EIP防护流量 请求',
    '多维交互分析服务 接口定义 日期与时间规范',
    '多维交互分析服务 API规范定义 接口设计原则',
    '多维交互分析服务 API规范定义 缩略语',
    '镜像服务 镜像共享 镜像属性',
]




if __name__ == "__main__":
    pass