# -*- coding: utf-8 -*-
"""
templates_x1是只有一个查询词的模板，共4种：
1.x1?
2.如何x1?
3.x1有哪些？
4.x1是什么？
"""
__title__ = 'QGDT-cpu'
__author__ = 'Ex_treme'
__license__ = 'MIT'
__copyright__ = 'Copyright 2018, Ex_treme'

#x1?
x1_1 = [
    '数据快递服务操作指导',
    '上云攻略',
    '卸载云硬盘时数据会丢失吗',
    '云硬盘有多少种状态',
    '快照有多少种状态',
    '一台云服务器可以挂载几块云硬盘',
    '怎么扩容数据盘',
]

#如何x1?
x1_2 = [
    '关闭Anti-DDoS服务',
    '更新Anti-DDoS服务',
    '制作镜像',
    '批量更新镜像成员状态',
    '导出镜像',
    '挂载云硬盘（OpenStack原生）'

]

#x1有哪些?
x1_3 = [
    '通信平台云常见问题',
    '密钥管理服务常见问题',
    '操作类常见问题',
    '安全组常见问题',
    '接口调用方法',
    '文档修订记录',
]


#x1是什么?
x1_4 = [
    'Anti-DDoS流量清洗',
    '多维交互分析服务',
    '弹性负载均衡',
    '弹性负载均衡监控指标说明',
    'AK/SK认证',
]




if __name__ == "__main__":
    pass